*&---------------------------------------------------------------------*
*& Report ZTYPES_04_KJH
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
REPORT ZTYPES_04_KJH.


" TYPE 정의 "



DATA:
  GV_CHAR10(10),
  GV_INT      TYPE I,

*총 5자리 숫자 저장하며, 그 중 2자리는 소수
*즉, 정수부는 최대 3자리, 소수부는 2자리입니다.
*저장 가능한 범위는: -999.99 ~ +999.99
  GV_DEC5_2   TYPE P LENGTH 5 DECIMALS 2.


GV_CHAR10 = '감자'.
GV_INT    = 12345.
GV_DEC5_2 = '12.34'.

WRITE: / GV_CHAR10, GV_INT, GV_DEC5_2.